Repository: 84000/data-translation-memory
Catalog: toh349-v4.tmx
Source language: bo
Languages: en

source: ངའི་ལུས་ཀྱི་ཕྱད་རོ་སྨད་མྱུར་དུ་ཆོད་ཅིག །བྲམ་ཟེའི་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: Will you take this saw and quickly cut off the lower half of my body? Let us fulfill the brahmin’s wish.

source: །ངའི་བྱང་ཆུབ་རྙེད་པའི་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Let us fulfill my wish to attain awakening.’

source: །དེ་ནས་ཤིང་མཁན་དེ་གཉིས་ཡུལ་རྨུས་པ་ལྟ་བུའི་མཆི་མའི་གདོང་ཅན་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་ལ་གཏུགས་ཏེ་སྨྲས་པ།
en: “Tears of immense sadness covered the two carpenters’ faces like stormy weather. They touched the bodhisattva’s feet and said,

source: ལྷ་འདི་སྐད་གསུང་བ་ནི་རིགས་པ་མ་ལགས་ཏེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། གལ་ཏེ་གཞན་འགའ་ཞིག་ལྷའི་ཐུགས་སུ་མི་བྱོན་པ་བགྱིད་ན་དེ་ལ་ཡང་བདག་ཅག་གིས་བཟློག་པར་བགྱི་བ་ལགས་ན། ལྷ་ཉིད་ཀྱི་སྐུ་ལ་མཚོན་གྱིས་འདེབས་པར་ཇི་ལྟར་རྔོ་ཐོགས།
en: ‘Lord, your words are inappropriate. If someone else were to challenge you, we could oppose them. But how are we to use a weapon against you?

source: ལྷ་གཞན་ཡང་གལ་ཏེ་བདག་ཅག་གཉིས་ཀྱིས་ཐུགས་རྗེ་ཆེ་བ། བྱམས་པའི་བདག་ཉིད་ཅན། སེམས་ཅན་ཐམས་ཅད་ལ་མཉེས་གཤིན་པ།
en: You are compassionate, loving, pleasing, and affectionate toward all sentient beings.

source: འཛམ་བུའི་གླིང་ཡོངས་སུ་སྐྱོང་བར་མཛད་པ་ཁྱེད་ཀྱི་སྐུ་ལ་སོག་ལེས་གཅོད་པར་བགྱིད་ན་ངེས་པར་འཕྲལ་དུ་རང་གི་ལས་ཀྱིས་དམྱལ་བར་ལྟུང་བར་འགྱུར་རོ།
en: You take care of all of Jambudvīpa. If we were to use this saw to cut through your body, our actions would cause us to fall instantly into hell.’

source: །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། བུ་དག་ངའི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པའི་བདུད་རྩི་ཐ་མའི་བར་ཆད་ཁྱེད་ཅག་མ་བྱེད་ཅིག །དེ་བས་ན་ཚུར་ཤོག །ཇི་སྲིད་དུ་བྲམ་ཟེ་འདི་གསོན་པ་དེ་སྲིད་དུ་ངའི་བྱང་ཆུབ་ལ་གྲོགས་བྱ་བའི་ཕྱིར་མྱུར་དུ་ངའི་ལུས་ཀྱི་ཕྱེད་རོ་སྨད་ཆོད་ཅིག །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སྐྱེས་བུ་ཤིང་མཁན་གཉིས་ཇི་ལྟར་དེ་ལ་ཀུན་དུ་འཇུག་པར་འགྱུར་བ་དེ་ལྟར་བྱིན་གྱིས་བརླབས་སོ།
en: “ ‘Sons,’ responded the bodhisattva, ‘do not block the final outpouring of the immortal elixir of a bodhisattva’s patience. Come here, help me to awaken. Cut off the lower half of my body while the brahmin is still alive.’ “Śakra, lord of the gods, used his power to compel the two carpenters to begin the process.

source: །ཡང་བར་སྐབས་དེར་སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་འདུས་པ་རྣམས་དང་། ནམ་མཁའི་ངོས་ན་ལྷ་བརྒྱ་སྟོང་དུ་མ་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཤིན་ཏུ་དཀའ་བ་དང་། བ་སྤུ་ལྡང་བའི་ལས་དེ་བལྟ་བར་འདོད་ནས་འདུས་པར་གྱུར་ཏོ།
en: A little while later, hundreds of thousands of people had gathered in the royal estate and hundreds of thousands of gods had gathered in the sky. They had flocked to see the bodhisattva perform this extremely difficult task, a task so difficult it made their body hairs stand on end.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བསི་རང་གི་ལུས་ཡོངས་སུ་གཏོང་བར་འདོད་ནས་སློང་བ་དེ་ལ་བྱམས་པས་ཁྱབ་པར་བྱས་ཏེ་འཕྲལ་དུ་སེང་གེའི་ཁྲི་ལས་བབས་སོ།
en: The bodhisattva stepped down instantly from his lion throne. His intention to give away his body gave him extreme joy, and he was overwhelmed by his love for the brahmin who asked for it.

source: །དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་དཔལ་གྱི་སྡེ་སེང་གེའི་ཁྲི་ལས་བབས་པའི་རྗེས་ཐོགས་ཉིད་ལ་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཀྱི་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དེ་དག་ཐམས་ཅད་རྒྱལ་པོའི་ཕོ་བྲང་ཨ་རིཥྛ་ག་ལ་བ་དེར་འདུད་པར་གྱུར་ཏོ།
en: “Monks, at the very instant the bodhisattva Śrīsena stepped down from his lion throne, all of Jambudvīpa’s parasols, banners, and flags bent toward Ariṣṭa Estate.

source: །རྒྱལ་པོའི་ཕོ་བྲང་གྲོང་ཁྱེར་ཨ་རིཥྛའི་ཕྱོགས་བཞིར་སྐར་མདའ་ལྟུང་བ་དང་། གྲོང་ཁྱེར་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དང་བྲལ་བའི་ཉམ་ཐག་པས་སྒྲ་བསྒྲགས་པ།
en: Meteors fell toward it from the four directions. But those who dwelled in the city wailed with the pain of separation.

source: བྲམ་ཟེ་སྡིག་པ་ཅན་འདིས་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་གསོད་པར་འགྱུར་གྱིས་མྱུར་དུ་གྲོང་ཁྱེར་འདི་ནས་ཕྱིར་ཕྱུང་ཤིག །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཇི་ལྟར་སྒྲ་སུས་ཀྱང་མ་ཐོས་པ་དེ་ལྟར་བྱིན་གྱིས་བརླབས་ཤིང་སྐྱེ་བོའི་ཚོགས་དེ་རྨོངས་པར་བྱས་སོ།
en: ‘This evil brahmin is going to kill King Śrīsena!’ they shouted. ‘Throw him out of here!’ “Śakra, lord of the gods, prevented the people from hearing what was happening. They were stupefied.

source: །བར་སྣང་དང་ས་ལ་རྒྱུ་བའི་གནོད་སྦྱིན་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་རང་གི་ལུས་ལ་ལྟོས་པ་མེད་པར་ཤེས་ནས་སྡུག་བསྔལ་དྲག་པོ་རྣམས་ཀྱིས་གདུངས་ནས་ཉམ་ཐག་པའི་ང་རོས་ཆོ་ངེས་འདེབས་པར་བརྩམས་ཏེ།
en: The yakṣas, those who dwell in space and on the ground, came to know that the bodhisattva was unconcerned with his body and wailed in the torment of their immense sorrow. ‘Alas,’ they cried, ‘King Śrīsena!

source: ཀྱི་ཧུད་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་འཛམ་བུའི་གླིང་ཡོངས་སུ་སྐྱོང་བར་བྱེད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བ། ཐམས་ཅད་ནས་ཐམས་ཅད་དུ་ལུས་གཏོང་བར་གྱུར་ཏོ། །དེ་ནས་ཡང་ཕོ་བྲང་གི་ནང་ན་གནས་པའི་ལྷ་ཞིག་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུའི་རང་གི་ལུས་ཡོངས་སུ་གཏོང་བར་ཤེས་ནས་ཆོ་ངེས་འདེབས་པར་རྩོམ་ཞིང་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ། །ཇི་ལྟར་ད་ལྟར་འདི་ལྟ་བུའི་སློངས་མོ་པ་འོངས་ནས་རྒྱལ་པོ་དཔལ་གྱི་སྡེ་ཡོན་ཏན་དུ་མ་དང་ལྡན་པ་ཐམས་ཅད་ནས་ཐམས་ཅད་དུ་མི་འཚོ་བར་གྱུར།
en: He who takes care of everyone in Jambudvīpa, he who is compassionate toward all sentient beings, he will give up his entire body!’ A deity who lived on the royal estate also came to know that he would give up his entire body, and lamented aloud, ‘King Śrīsena, he who is endowed with so many qualities, is not going to survive because of this beggar!’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཕྱོགས་བཞིར་བལྟས་ཏེ་ཡང་དག་པའི་སྨོན་ལམ་འདེབས་པ་ལ་ཞུགས་པ་གང་གྲོང་ཁྱེར་འདི་ན་གནས་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། མིའམ་ཅི་རྣམས་བདག་ལ་གསོན་ཅིག །བདག་འདིར་གཏོང་བར་བྱེད་དེ།
en: “After this, the bodhisattva looked around in the four directions. ‘Gods, nāgas, yakṣas, and kinnaras, all you who dwell in this city, listen! Make pure prayers for me! I am making this gift today.

source: གཏོང་བ་ཤིན་ཏུ་གཏོང་བ་རང་གི་ལུས་ཡོངས་སུ་གཏོང་བར་བྱེད་ཀྱིས་བདག་གི་ལུས་ཡོངས་སུ་གཏོང་བ་དེ་ཡང་རྒྱལ་པོའི་ཕྱིར་མ་ཡིན། མཐོ་རིས་ཀྱི་ཕྱིར་མ་ཡིན།
en: I am making the greatest of gifts, the gift of one’s body. I am not making this gift for myself, the king, nor to attain rebirth in a higher realm.

source: བརྒྱ་བྱིན་གྱི་ཕྱིར་མ་ཡིན། ཚངས་པའི་ཕྱིར་མ་ཡིན།
en: I am not making it for Śakra or for Brahmā.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་ཕྱིར་མ་ཡིན་གྱི།
en: I am not making it to become a universal monarch.

source: གཞན་དུ་ན་བདག་གིས་ཅི་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་མ་བསྒྲལ་བ་རྣམས་བསྒྲལ་བར་བྱ་བ་དང་། མ་གྲོལ་བ་རྣམས་དགྲོལ་བར་བྱ་བ་དང་། དབུགས་མ་ཕྱིན་པ་རྣམས་དབུགས་དབྱུང་བར་བྱ་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་བདེན་པ་དང་བདེན་པའི་ཚིག་འདིས་ངལ་བ་འབྲས་བུ་དང་བཅས་པར་གྱུར་ཅིག །བདག་མངོན་པར་བྱང་ཆུབ་ནས་ཀྱང་མཚན་མ་ཅུང་ཟད་ཅིག་འབྱུང་བར་གྱུར་ཅིག་ཅེས་སྨྲས་ཏེ་བྲམ་ཟེ་དེ་ལ་སྨྲས་པ།
en: I make this gift to attain unsurpassed and perfect awakening. I make it to liberate sentient beings who are not yet liberated. I make it to console those who need consoling, to unbind those who are bound. By the truth of my words, may it be accomplished. May some small sign of my awakening appear!’

source: དེས་པ་ཁྱོད་ཀྱི་ཀུན་དུ་རྟོག་པ་འབྱོར་པར་གྱུར་ཅིག །ཁྱོད་ཀྱི་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །ངའི་ཡང་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཉེ་དུའི་སྐྱེ་བོ་རྣམས་དང་། གྲོང་ཁྱེར་པའི་སྐྱེ་བོ་རྣམས་ལ་བཟོད་པར་བྱས་ཤིང་དམན་པ་དང་། ནད་པ་རྣམས་དབུགས་ཕྱུང་ནས་སྐྱེས་བུ་ཤིང་མཁན་དེ་གཉིས་ལ་སྨྲས་པ།
en: “To the brahmin, he said, ‘By this action, may you attain all you have imagined. May all your wishes be fulfilled. And may I realize unsurpassed awakening completely.’ “The bodhisattva asked his relatives and the city’s inhabitants for patience. He consoled the poor and stricken, before speaking to the two carpenters.

source: བཞིན་བཟངས་དག་ཚུར་ཤོག །ཇི་སྲིད་དུ་བྲམ་ཟེ་འདི་དུས་མ་བྱས་ཀྱི་བར་དུ་སོག་ལེ་ཟུང་ལ་ངའི་ལུས་ལྟེ་བ་ཡན་ཅད་ཆོད་ཅིག །འགྲོ་བ་སྡུག་བསྔལ་གྱིས་ཟིན་པ་འདི་དག་ཐམས་ཅད་ཀྱང་ངས་ཡོངས་སུ་བསྐྱབ་པར་བྱའོ་ཞེས་བྱམས་པས་ཁྱབ་པར་བྱས་ནས་སྐྱེས་བུ་གཅིག་གིས་རྒྱབ་ནས་བརྟེན་ཏེ། འཕྲལ་དུ་རྐང་པ་གཉིས་ས་ལ་བརྐྱང་ནས་གན་རྐྱལ་དུ་ཕབ་བོ། །
en: ‘Good people, come here. Before the brahmin’s time runs out, saw at my navel. May I protect all beings who suffer!’ In this way, with love suffusing all, and with the help of a man who supported him, he promptly lay down on his back and stretched out his legs.

source: དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་ཕབ་མ་ཐག་ཡང་ས་ཆེན་པོ་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏོ། །དེ་ནས་བཙུན་མོ་བུད་མེད་རྣམས་ཀྱིས་དེ་ལྟ་བུའི་གཏམ་ཐོས་ནས་མྱ་ངན་དྲག་པོས་གདུངས་ཏེ།
en: “Monks, as the bodhisattva was lowered onto the ground, the great earth shook in six different ways. The ladies of the court were deeply tormented when they heard the news and rushed to the bodhisattva’s side. Tears poured down their faces like rain. They let their hair fall and beat their chests in mourning.

source: ཀྱི་ཧུད་འདི་ནི་སྡུག་བསྔལ་ལོ་ཞེས་གདོང་ལས་མཆི་མ་ཆར་བཞིན་དུ་འབབ་ཅིང་སྐྲ་རྣམས་བཀྲོལ་ཏེ་བྲང་རྡུང་ཞིང་རྟབས་བག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ལྷ་མོ་ལྟ་བུ་སྡུག་པ་དང་བྲལ་ནས་རྟབས་བག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་ལ་གཏུགས་ནས་སྙིང་རྗེ་རྗེ་སྐད་དུ་སྨྲེ་སྔགས་འདོན་པར་རྩོམ་པ་ན།
en: ‘Alas,’ they cried, ‘the pain!’ They were no longer attractive like goddesses. They touched the bodhisattva’s feet briefly and wailed, ‘Please have mercy!’

source: ཀྱི་ཧུད་འཛམ་བུའི་གླིང་ཡོངས་སུ་སྐྱོང་བར་མཛད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་མཉེས་གཤིན་པ། སྙིང་རྗེ་ཆེ་བ། ཡོན་ཏན་དུ་མ་དང་ལྡན་པའི་ལྷ་ལ་དེང་ཉིད་དུ་མི་རྟག་པ་ཉིད་ཀྱི་སྟོབས་ཉེ་བར་གནས་པ་འདི་སྡུག་བསྔལ་ལོ། །དེང་འདིར་བདག་ཅག་ལྷ་དང་ལྷན་ཅིག་པ་ལས་ཐ་དད་པར་གྱུར་ཏེ། སོ་སོ་བ་དང་། བྱེ་བ་དང་བྲལ་བར་གྱུར་ཏོ། །
en: ‘Alas,’ they cried, ‘it pains us that the power of impermanence is now at hand and today will separate, isolate, detach, and remove us from our relationships with this lord. He is the lord who protects all of Jambudvīpa, who pleases and is affectionate toward all sentient beings, who has immense compassion, and who has innumerable good qualities.’

source: འདི་སྐད་ཅེས་ཀྱང་སྨྲས་ཏེ། ལྷ་བཟོད་པར་མཛོད་ཅིག །ཉིད་ཀྱི་སྲོག་མེད་པར་མཛད་པས་འཛམ་བུའི་གླིང་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་མགོན་མེད་པར་མི་མཛད་དུ་གསོལ།
en: “ ‘Lord,’ they persisted, ‘please have patience with us! Please don’t leave all of the communities of people living in Jambudvīpa without a protector by taking your own life.

source: ལྷ་བཙུན་མོའི་འཁོར་རྣམས་དང་། མཛོད་དང་བང་བ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རྒྱས་ཤིང་ཡོངས་སུ་གང་བ་ལ་གཟིགས་སུ་གསོལ། འཛམ་བུའི་གླིང་གི་སྐྱེ་བོའི་ཚོགས་རྟག་ཏུ་རབ་ཏུ་དགའ་བ་རྣམ་པ་སྣ་ཚོགས་པ་ལ་ཡང་གཟིགས་སུ་གསོལ།
en: Lord, please look at the ladies of the court and your vast treasuries and storehouses filled with myriad precious gems. Look at Jambudvīpa’s people, who are always experiencing many types of happiness.

source: ལྷ་རྣམས་ཀྱི་དགའ་བའི་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་ལྟ་བུའི་གྲོང་ཁྱེར་ཨ་རིཥྛ་བཟང་བ་མང་པོ་ཕུན་སུམ་ཚོགས་པར་སྐྱེ་བོ་རབ་ཏུ་དགའ་བ་རྣམས་བསྟེན་པ་ལ་ཡང་གཟིགས་སུ་གསོལ།
en: Look at the city of Ariṣṭa, which resembles a divine park complete with an abundance of fine features, where so many joyful people live.

source: །མགོན་པོ་ཁྱོད་ཀྱིས་རྣམ་ཀུན་དུ།
en: “ ‘Protector, you have always taken care of everyone

source: །སྲས་ལྟར་ཡོངས་སུ་བསྐྱངས་པ་རྣམས།
en: As if they were your own children.

source: །ཁྱོད་བྲལ་མེ་ཡིས་ངེས་གདུངས་ནས། །ལུས་ཅན་ཇི་ལྟར་གནས་པར་འགྱུར།
en: How will these beings survive When they are surely scorched by the fire of losing you?

source: །ཁྱོད་དང་བྲལ་ན་བདག་ཅག་ཀུན། །ཤིན་ཏུ་འཆི་བདག་དབང་དུ་འགྱུར།
en: “ ‘If separated from you, We will all be overpowered by the Lord of Death.

source: །མགོན་པོ་ཁྱོད་དང་རྣམ་བྲལ་ན།
en: O Protector, if we are separated from you,

source: །བདག་ཅག་འཚོ་བར་མི་ནུས་སོ།
en: We will not be able to survive!

source: །བཙུན་མོ་མྱ་ངན་གྱིས་གདུངས་དང་། །སེམས་ཅན་གཅིག་ཏུ་སྡུག་བསྔལ་ན།
en: “ ‘If the queen is stricken by suffering, And if sentient beings all suffer as one, We pray that you look upon us, ruler of humans,

source: །ཐུགས་རྗེ་ལྡན་པའི་ཐུགས་རྗེ་ཡིས། །མི་དབང་དེ་ནི་གཟིགས་སུ་གསོལ།
en: With the compassion of one who embodies compassion.

source: །སེམས་ཅན་རྣམས་ལ་མཉེས་གཤིན་ལྷ།
en: “ ‘Lord who is affectionate toward all beings,

source: །བཟོད་མཛོད་སྲོག་ནི་མི་གཏོང་གསོལ།
en: Please take care of us—don’t give away your life!

source: །མགོན་པོ་དཔའ་བོ་ཁྱོད་གཤེགས་ན།
en: Who will be our protector, our hero, if you pass on?

source: །སུ་ཞིག་འཇིག་རྟེན་སྐྱོང་བར་འགྱུར།
en: Who will protect the world?’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་དེ་རྣམས་ཀྱི་སྙིང་རྗེ་རྗེ་སྐད་དུ་དེ་ལྟར་སྨྲེ་སྔགས་འདོན་པ་ཐོས་པ་དང་། སྙིང་རྗེས་གདུངས་པའི་ཡིད་ཀྱིས་དེ་རྣམས་དབུགས་དབྱུང་བའི་ཕྱིར་སྨྲས་པ།
en: “After hearing their pitiable lament, the bodhisattva’s heart was heavy with compassion.

source: ཁྱེད་ཅག་རྣམས་ཀྱི་མྱ་ངན་གྱིས་ཆོག་གིས། ཤིན་ཏུ་ཡུན་རིང་པོར་སྡུག་པ་དང་ཕྲད་པར་གྱུར་པ་ཡང་ངེས་པར་ཐ་མར་འབྲལ་བའི་མཐའ་ཉིད་དུ་འགྱུར་བ་འདི་ནི་འཇིག་རྟེན་གྱི་རང་བཞིན་ཡིན་ཏེ།
en: ‘Your lament is understandable,’ he said to console them, ‘but it is the way of the world that we must separate even from those we have known for a long time.

source: ཁྱེད་ཅག་རྣམས་ཀྱིས་རྟག་ཏུ་དགེ་བའི་ཆོས་རྣམས་ལ་བག་ཡོད་པར་གྱིས་ཤིག་ཅེས་སྨྲས་ནས་ཤིང་མཁན་དེ་གཉིས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: For this reason, you should always be mindful of virtuous deeds.’ Then he turned to the two carpenters again and said, ‘Good people, come here.

source: །བཞིན་བཟངས་དག་རིངས་པར་ཤོག་ལ་ལུས་ཡུན་རིང་པོ་མི་ཐོགས་པར་ཆོད་ཅིག་ཅེས་སྨྲས་པ་ཙམ་གྱིས་དེ་གཉིས་ཀྱང་བརྒྱ་བྱིན་གྱིས་ཀུན་དུ་རྨོངས་པར་བྱས་པས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལྟེ་བ་མན་ཆད་ལ་འཕྲལ་དུ་སོག་ལེས་བཏབ་སྟེ། རིང་པོར་མ་ཐོགས་པར་ཆོད་པར་གྱུར་ཏོ། །
en: Without taking too much time, cut my body.’ “Because Śakra had enchanted them, the two carpenters immediately began sawing the bodhisattva’s body at his navel.

source: དེ་ནས་བློན་པོ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའི་ཤིན་ཏུ་དཀའ་ཞིང་བཟོད་པར་དཀའ་བའི་སྡུག་བསྔལ་མི་བཟད་པ་དྲན་པའི་མྱ་ངན་དྲག་པོས་ཀུན་དུ་སྐྲག་པའི་ཡིད་ཀྱིས་རྟབས་བག་ཏུ་ཤིང་མཁན་གཉིས་བཟློག་ཅིང་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Mahāmati, revived and imagining the unbearably intense pain the bodhisattva was experiencing, rebuked the two carpenters.

source: །ཀྱི་ཧུད་ཀྱི་ཧུད་ཁྱེད་ཅག་གཉིས་ཀྱི་རྩོལ་བ་འདི་ཅི་ཞིག །འདི་ལྟར་ཁྱེད་ཅག་གཉིས་ཀྱིས་བྱམས་པའི་བདག་ཉིད་ཅན།
en: ‘Alas,’ he cried, ‘alas! What are the two of you doing! How can you kill the compassionate one?

source: སེམས་ཅན་ཐམས་ཅད་ལ་མཉེས་གཤིན་པ། ཡོན་ཏན་དུ་མ་དང་ལྡན་པ། འཛམ་བུའི་གླིང་ཡོངས་སུ་སྐྱོང་བ། སྐྱོན་མེད་པ། གནོད་པ་མི་བྱེད་པ་འདི་ཇི་ལྟར་གསོད།
en: How can you kill the one who is pleasing and affectionate to everyone, he who has numerous good qualities, he who takes care of all of Jambudvīpa, he who is faultless and harms none?

source: མི་གཏི་མུག་ཅན་ཁྱེད་ཅག་འདི་ལྟ་བུའི་ཆོས་ཀྱི་རྒྱལ་པོ་ཇི་ལྟར་གསོད་པར་སྤྲོ།
en: How can you ignorant people take joy in killing a Dharma king?

source: ཁྱེད་ཅག་གཉིས་ས་ཆེན་པོའི་ལྷ་མོ་འདིས་ཇི་ལྟར་འཇོག །ཁྱེད་ཅག་གཉིས་ལ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟ་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱིས་རྡོ་རྗེ་རྩེ་གཅིག་པ་དང་། འཁོར་ལོ་དང་། མདའ་བོ་ཆེ་དང་། མཚོན་རྩེ་གཅིག་པ་ལ་སོགས་པའི་མཚོན་རྣམས་ཇི་སྟེ་མ་བསྣུན།
en: How does this great land’s goddess allow you to live? Why haven’t you been pierced by the single-pointed vajra? The weapon-wheel? The great arrow? The single-pointed weapons of the gods, nāgas, yakṣas, asuras, gandharvas, garuḍas, kinnaras, and mahoragas?

source: ཁྱེད་ཅག་གཉིས་འདི་ལྟ་བུའི་འཕགས་པ་མ་ཡིན་པའི་ལས་བྱེད་ན་ལུས་རྣམ་པ་སྟོང་དུ་ཇི་ལྟར་མ་ལྷགས།
en: You have committed such an ignoble act. How is it that your bodies have not exploded into a thousand pieces?

source: ཁྱེད་ཅག་གཉིས་རང་གི་ལུས་ཀྱིས་འཕྲལ་དུ་དམྱལ་བར་ཇི་ལྟར་མ་ལྷུང་།
en: Why haven’t you fallen instantly into hell, in this very body?

source: མི་གཏི་མུག་ཅན་ཁྱེད་ཅག་གཉིས་བདག་ཉིད་ཆེན་པོ་འདིས་བུ་བཞིན་མ་བསྐྱངས་སམ་ཞེས་འདི་དང་གཞན་ཡང་རྣམ་པ་མང་པོ་སྨྲས་ནས་ཀྱི་ཧུད་ལྷ་ཞེས་བློན་པོ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོ་རིངས་པར་སྟན་ལས་ལངས་ཏེ། ལག་པ་གཉིས་ཀྱིས་སོག་ལེ་བཟུང་ནས་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལ་མཆི་མ་འཛག་པས་བརླན་པར་བྱས་ཏེ་ཟློག་པར་བྱེད་དོ།
en: Didn’t this great being also treat you as his sons? You ignorant beings!’ “He said these things and many others besides. ‘Alas, lord!’ he cried, and getting up from his seat, Mahāmati, the great minister, grabbed the saw with his own two hands, and as his tears wet the bodhisattva’s body, he pushed the two carpenters away.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཞུམ་པའི་ཡིད་དེ་ལ་དབུགས་དབྱུང་བའི་ཕྱིར་སྨྲས་པ།
en: To console the discouraged Mahāmati, the bodhisattva said,

source: བུ་ཞོག་ཞོག་མྱ་ངན་མ་བྱེད་ཅིག །སྡུག་པ་དང་ཕངས་པ་དང་ཡིད་དུ་འོང་བ་དང་མངོན་པར་དགའ་བ་ཐམས་ཅད་ངེས་པར་ཐ་དད་པར་གྱུར་ཏེ།
en: ‘Son, leave it be, leave it be. Do not lament. It is certain that we will be separated from those dear to us, those we love, those who draw near to us, and those of whom we are extremely fond.

source: སོ་སོ་བ་དང་བྱེ་བ་དང་འབྲལ་བར་འགྱུར་རོ།
en: We will be isolated, divided, and separated.

source: །གཞན་ཡང་བུ།
en: Moreover, son:

source: བསགས་པ་ཀུན་གྱི་མཐའ་ཟད་ཅིང་།
en: “ ‘The end of all accumulation is dispersion.

source: །བསླང་བའི་མཐའ་ནི་འགྱེལ་བར་འགྱུར།
en: The end of rising is falling.

source: །ཕྲད་པའི་མཐའ་ནི་འབྲལ་བ་སྟེ།
en: The end of meeting is parting.

source: །གསོན་པའི་མཐའ་ནི་འཆི་བ་ཡིན།
en: The end of living is dying.

source: །དེའི་ཕྱིར་ཁྱོད་ལུས་སློང་བ་ལ་བར་ཆད་མ་བྱེད་ཅིག །
en: “ ‘Therefore, do not stop those who ask for my body.

source: བློ་གྲོས་ཆེན་པོ་སྔོན་བྱུང་བ་ན་ངའི་ལུས་སློང་བ་ན་ལྷ་མོ་རྣམས་ཀྱིས་བར་ཆད་བྱས་ཏེ།
en: Mahāmati, in the past, another person tried to ask for my body but goddesses stopped them.

source: དེ་རྣམས་ཀྱིས་ངའི་བར་ཆད་བྱས་པས་ངའི་བླ་ན་མེད་པའི་བྱང་ཆུབ་ལ་བར་ཆད་བྱས་ལ་བདག་ཉིད་ཀྱང་བསོད་ནམས་མ་ཡིན་པ་མང་པོ་སྐྱེས་སོ།
en: Not only did those goddesses prevent me from achieving unsurpassed awakening, they also created much nonvirtue.

source: །གལ་ཏེ་ངའི་ལུས་སློང་བ་ལ་ལྷ་མོ་རྣམས་ཀྱིས་བར་ཆད་མ་བྱས་པར་གྱུར་ན་ནི་ཡུན་རིང་པོ་མི་ཐོགས་པར་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་རོ།
en: If the goddesses had not prevented that person asking for my body, I would have attained unsurpassed and perfect awakening by now.

source: །བུ་གཞན་ཡང་ས་ཕྱོགས་འདི་ཉིད་དུ་སྟག་མོ་ཞིག་བཀྲེས་པའི་སྡུག་བསྔལ་གྱི་ཚོར་བ་མང་པོས་ལུས་གདུངས་པས་བུ་ཟ་འདོད་པ་མཐོང་བ་དང་། མཆོག་ཏུ་སྙིང་རྗེའི་དབང་དུ་སོང་བའི་ཡིད་ཀྱིས་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར་དེ་མ་ཐག་བདག་ཉིད་ཡོངས་སུ་བཏང་བས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་བསྐལ་པ་བཞི་བཅུར་ཞུགས་པ་ཕྱིར་ལུས་པར་བྱས་སོ།
en: “ ‘What is more, son, in this very place I met a tigress whose hunger pains were so intense that she wanted to eat her own cubs. Out of supreme compassion, I gave myself to her immediately so that she might be saved. By so doing, I surpassed the deeds of the bodhisattva Maitreya, who had set out for buddhahood forty eons before that.

source: །གཞན་ཡང་བློ་གྲོས་ཆེན་པོ་ང་ཤི་བི་པའི་རྒྱལ་པོར་གྱུར་པ་ན་ཡང་བྲམ་ཟེ་རྒན་པོ་ཞིག་སློང་བ་མཐོང་སྟེ།
en: “ ‘Another time, Mahāmati, when I was king of the Śibi people, an old brahmin came seeking the gift of sight.

source: སྙིང་རྗེས་བསྐྱོད་པའི་ཡིད་ཀྱིས་སློང་བའི་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་རང་ཉིད་ཀྱི་ཨུད་པ་ལ་སྔོན་པོའི་ལོ་མ་ལྟ་བུ་དྲི་མ་མེད་པ། ཤིན་ཏུ་མཛེས་པ།
en: Moved by compassion, I immediately extracted my unimpaired eyes and gave them to him, while they were still stained with blood.

source: སེམས་ཅན་སྐྱེ་བོའི་མིག་དང་ཡིད་འཕྲོག་པ་མ་ཉམས་པའི་མིག་གཉིས་འཕྲལ་དུ་ཁྲག་དང་བཅས་པར་ཕྱུང་ནས་བྱིན་ནོ། །གཞན་ཡང་བློ་གྲོས་ཆེན་པོ་ཡང་ང་རྒྱལ་པོ་ཟླ་འོད་དུ་གྱུར་པ་ན་ཡང་བྲམ་ཟེ་དྲག་པོའི་མིག་མགོ་སློང་བ་ལ་མཆོག་ཏུ་སྙིང་རྗེས་བསྒོས་པའི་ཡིད་ཀྱིས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། གྲུབ་པ་དང་། རིག་པ་འཛིན་པའི་ཚོགས་རྣམས་དང་། ལྷ་བརྒྱ་སྟོང་དུ་མ་རྣམས་ཀྱིས་བཀག་ཀྱང་ངས་འགྲོ་བ་འདི་དག་མགོན་མེད་པར་མཐོང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་སྟེ། སེམས་ཅན་རྣམས་འཁོར་བའི་འབྲོག་དགོན་པ་ལས་ཐར་བར་བྱ་སྙམ་ནས་བྱམས་པས་ཁྱབ་པར་བྱས་ཏེ།
en: My eyes had been as unstained as an utpala flower, a blue lotus. They were extremely beautiful and captured the hearts and attention of all people—indeed, all beings. “ ‘Yet another time, Mahāmati, when I was a king named Candraprabha, a brahmin rudely asked me for not only my eyes but also my head. Groups of nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, siddhas, vidyādharas, and hundreds of thousands of gods tried to stop me from making this gift. Despite all this opposition, I saw that sentient beings had no protector, and with the loving intention to liberate them from saṃsāra’s wilderness, I aspired to attain unsurpassed and perfect awakening.

source: རང་གི་ནོར་བུ་དང་གསེར་དང་དངུལ་དང་བཻ་དཱུརྱ་དང་རྡོ་རྗེ་དང་ཨིན་དྲ་ནཱི་ལ་དང་། མར་གད་ཀྱིས་ཀུན་དུ་བརྒྱན་པ། ཨུད་པ་ལ་སྔོན་པོའི་ལོ་མ་ལྟ་བུའི་རལ་གྲིས་རང་གི་མགོ་རྩྭ་བཞིན་དུ་བཅད་ཅིང་བཅད་ཅིང་བྱིན་ནོ།
en: My sword was the blue color of an utpala flower. It was decorated with precious gems, gold, silver, beryl, diamonds, sapphires, and emeralds. I picked it up and chopped off my head as if it were a blade of grass, and then I gave it to the brahmin.

source: །གཞན་ཡང་བློ་གྲོས་ཆེན་པོ་ཡང་ང་ཤི་བི་པའི་རྒྱལ་པོར་གྱུར་པ་ན་ཕུག་རོན་སྐྱབས་མེད་པ་ཞིག་ཁྲས་འཇིགས་ཤིང་སྐྲག་ལ་སྡུག་བསྔལ་ཞིང་བཞིན་རྨོགས་པ།
en: “ ‘Another time, Mahāmati, when I was again king of the Śibi people, I saw an unprotected, terrified pigeon, ducking and diving as it was chased by a hawk.

source: སྐྱབས་མེད་པ་སྐྱབས་སུ་འོངས་པ་མཐོང་སྟེ། མཆོག་ཏུ་སྙིང་རྗེས་འདར་བའི་ཡིད་ཀྱིས་བྱ་ཕུག་རོན་ཁྲ་ལས་ཡོངས་སུ་བསྲུང་ཞིང་བླུ་བའི་ཕྱིར་རང་གི་ཤ་བཅད་ཅིང་བཅད་ཅིང་བྱིན་ནོ།
en: As I watched the unprotected pigeon seek refuge, I shook with supreme compassion. To protect the pigeon from the hawk and to deceive the hawk, I cut off a piece of my own flesh and gave it to the hawk.

source: །གཞན་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་འདོད་པར་བྱ་བའི་ཕྱིར་ས་ཕྱོགས་འདི་ཉིད་དུ་རྐང་པ་དང་ལག་པ་དང་བུ་དང་ཆུང་མ་སྟོང་ཕྲག་ཡོངས་སུ་བཏང་བ་བྱས་ན་ཡང་སུས་ཀྱང་བར་ཆད་མ་བྱས་སོ།
en: “ ‘In the past, in this very land, I have given thousands of legs, hands, sons, and wives for the sake of unsurpassed and perfect awakening, and no one stopped me.

source: །དེའི་ཕྱིར་འདི་ལྟར་རིག་པར་བྱ་སྟེ།
en: You should understand this, Mahāmati.

source: ངའི་ལུས་སློང་བ་ལ་ཁྱོད་བར་ཆད་མ་བྱེད་ཅིག །དེ་ནས་བློན་པོ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ཆེན་པོ་སྐྱེས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་དད་པ་ཆེན་པོ་སྐྱེས་ཏེ།
en: And you should not stop the brahmin seeking my body.’ “Following this, the great minister Mahāmati understood that the bodhisattva had given rise to great miraculous powers, and he developed profound faith in him.

source: དེ་ནས་ཅང་མི་སྨྲ་བར་གྱུར་ཅིང་མཆི་མའི་དབའ་རླབས་ཀྱིས་ཡང་དང་ཡང་དུ་གདོང་ཁེབས་བཞིན་དུ་བསམས་པ།
en: This great minister remained silent while waves of tears flowed down his face continually.

source: ཀྱི་ཧུད་འཇིག་རྟེན་པ་འདི་དག་ནི་སྐལ་བ་ངན་པ་སྟེ།
en: He thought, ‘Alas, these beings are unfortunate.

source: མྱུར་བ་ཉིད་དུ་ཆོས་ཀྱི་རྒྱལ་པོ་འདིས་བོར་བར་འགྱུར་རོ།
en: They will soon lose their Dharma king.

source: །ཀྱི་ཧུད་ཆོས་ཀྱི་རྒྱལ་མཚན་འགྱེལ་བར་འགྱུར་རོ།
en: Alas, the Dharma’s victory banner is about to fall.

source: །ཆོས་ཀྱི་སྒྲོན་མ་ཤི་བར་འགྱུར་རོ།
en: “ ‘The lamp of Dharma will be extinguished.

source: །ཆོས་ཀྱི་སྒྲོན་མ་མི་སྣང་བར་འགྱུར་རོ།
en: The lamp of Dharma will disappear.

source: །ཆོས་ཀྱི་རྔ་ཆག་པར་འགྱུར་རོ།
en: The Dharma drum is about to break.

source: །ཆོས་ཀྱི་རྒྱ་མཚོ་སྐམས་པར་འགྱུར་རོ།
en: The ocean of Dharma will dry up.

source: །ཆོས་ཀྱི་རི་བོ་རྙིལ་བར་འགྱུར་རོ།
en: “ ‘The great mountain of Dharma will soon crumble.

source: །ཆོས་ཀྱི་གྲོང་ཁྱེར་ཆོམས་པར་འགྱུར་རོ།
en: The city of Dharma will soon be looted.

source: །ཆོས་ཀྱི་གྲུ་ཞིག་པར་འགྱུར་རོ།
en: The ship of Dharma will soon disintegrate.

source: །ཆོས་ཀྱི་ཤིང་ཕྱུང་བ་ནི་ཀྱི་ཧུད་སྡུག་བསྔལ་ལོ།
en: When the Dharma tree is uprooted, it is painful indeed. “ ‘The wheel of time is about to crush

source: །འདི་ནི་འཇིག་རྟེན་ཀུན་གྱི་ཕ།
en: The father of the entire world,

source: །སེམས་ཅན་ཀུན་ལ་ཕན་བྱེད་པ། །དུས་ཀྱི་འཁོར་ལོས་བཅོམ་ནས་ནི།
en: Who has helped all beings.

source: །རྒྱལ་པོ་ཆེན་པོ་མེད་པར་འགྱུར།
en: The great king will be no more.

source: །གང་ཕྱིར་མི་བཟད་དུས་འདིར་ནི། །རྣམ་པ་སྟོང་དུ་མ་གས་པ། །སྙིང་གི་བདག་ཉིད་ཆེན་པོ་ནི། །རྡོ་རྗེ་ཆེན་པོ་བཞིན་གྱུར་ཏམ།
en: “ ‘Yet, in this unbearable moment, Why hasn’t this great being’s mind Been shattered into a thousand pieces, But is instead like a great vajra?

source: །ཤིས་པའི་དུས་ནི་ཀུན་དུ་འདས།
en: “ ‘The good times are all gone.

source: །མི་བཟད་དུས་ནི་ཉེ་བར་གནས།
en: Unbearable times are now at hand.
